# HasRegions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..HasRegions Property
Face Class See Also
---
Identifies if the face contains regions (which can be created, for example, by the Split Face command).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasRegions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasRegions As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasRegions {
	bool get ();
}
```

# Remarks
If this is true, use GetRegions()()()() to get access to the specific Faces which make up the regions.
# See Also
Face Class
Autodesk.Revit.DB Namespace